/* 
레시피 재료 추가하기

1. 요구사항 확인하기
    - 재료명과 용량 칸에 값을 채운 후 추가 버튼이 눌렸을 때 아래 표에 추가되기
    - 이 때 입력한 재료명이 표에 이미 있다면 해당 표에서 삭제 후 추가버튼 눌러야함
    - 삭제는 관리열에 생기는 버튼으로 가능해야함
    - 표를 만든 후 제출 버튼이 눌렸을 때 표 아래 리스트형태로 모든 값이 보여야함

2. 요구사항 바탕으로 인풋 생각하기
    - 재료명과 용량의 인풋값
    - 추가 버튼이 눌렸을 때 실행될 함수(조건 맞춰 표에 값 추가)
    - 재료명이 이미 표에 있을 때 누르게할 삭제버튼
    - 제출 버튼이 눌렸을 때 표 아래 만들어질 리스트

3. 인풋 바탕으로 단계별 한글로 함수 설계하기
    1 DOM API를 이용하여 재료명과 용량의 input태그, <tr>, <ul>태그를 가져온다
    2 input태그의 value값을 <tr>아래 <td>로 추가시킬 함수 만들기
    3 해당 함수는 재료명 value가 <tr> <td>에 이미 있는지 확인후 없다면 값과 버튼까지 추가하는 기능
    4 만약 이미 있다면 alert로 삭제 후 다시 누르란 말 표시
    5 제출 버튼이 눌렸을 때 <ul> 아래 표 값을 value로 가진 <li> 생성하는 함수 만들기

4. 단계별 구글링 키워드 생각하기
*/
