// 1. 페이지가 로딩 될 때 이곳의 글씨를 변경하시오.
/*  1. 요구사항 확인하기
        - 페이지가 로딩이 완료되었을 때 글씨 변경되기

    2. 요구사항 바탕으로 인풋 생각하기
        - submit(form태그) 혹은 html이 열렸을 때 상황
        - 바뀌었을 때 표시될 텍스트

    3. 인풋 바탕으로 단계별 한글로 함수 설계하기
        - html이 다 열렸을 때 불릴 함수 window.onload를 활용한다
        - load 완료 시 <p>의 innerText로 표시할 텍스트를 넣는다

    4. 단계별 구글링 키워드 생각하기*/

// =====================================================================================

// 2. 탭을 선택하면 선택한 탭의 배경과 글자의 색이 바뀌도록 하시오.
/*  1. 요구사항 확인하기
        - 탭이 선택되었을 때를 표시할 배경과 글자색 정하기
        - 하나의 탭이 선택되면 다른 탭들은 선택 표시 해제되기

    2. 요구사항 바탕으로 인풋 생각하기
        - 클릭 이벤트

    3. 인풋 바탕으로 단계별 한글로 함수 설계하기
        - 클릭이 되었을 때를 알기 위해 console.log만 담은 함수와 addEventListener 연결하기
        - 콘솔로 확인이 된다면 클릭 상태일 때 css 배경색과 텍스트 색상 변경
        - 만약 다른 탭이 클릭이 된다면 해당 탭 제외 전부 css 원래대로 변경하기

    4. 단계별 구글링 키워드 생각하기
        - html 탭 선택된 것만 표시하는 법*/

// =====================================================================================

// 3. 위의 탭 클릭시 아래의 컨텐츠중 탭과 숫자가 같은 것만 보이게 하시오.
/*  1. 요구사항 확인하기
        - 2번의 탭이 눌리면 눌린 탭과 일치하는 컨텐츠만 보이고 나머지는 안보여야함
        - 안보이는 탭의 위치는 사라지지 않고 visible만 false 느낌

    2. 요구사항 바탕으로 인풋 생각하기
        - 2번의 탭과 연동해서 상태 변화하기

    3. 인풋 바탕으로 단계별 한글로 함수 설계하기
        - 2번 함수 구현 시 탭 선택되었을 때의 value와 일치하는 컨텐츠만 visible=true
        - 나머지는 visible=false

    4. 단계별 구글링 키워드 생각하기*/
    
// =====================================================================================

// 4. 아래의 입력창에 숫자가 입력되지 않도록 하고 길이 제한은 10자로 하시오.
/*  1. 요구사항 확인하기
        - 입력창에 길이 제한은 10자리로 글자입력받기
        - 숫자는 안됨

    2. 요구사항 바탕으로 인풋 생각하기
        - 입력 가능한 글자 수 제한주기 10자리로
        - 숫자 입력시 alert창 띄우기

    3. 인풋 바탕으로 단계별 한글로 함수 설계하기
        - maxLength를 10으로 설정하고
        - 숫자 입력시 alert뜨게 만들기

    4. 단계별 구글링 키워드 생각하기
        - input태그 숫자 입력 구분 */

// =====================================================================================

// 5. 아래의 입력창에 입력 후 저장 버튼을 누르거나 엔터키를 누르면 입력한 내용이 아래의 list에 추가 되도록 하시오.
//    초기화 버튼을 누르면 list안의 모든 내용이 지워져야함
